Mrklly/source/rs485_pinglian/stdlib/inc/hc32_timer3.h
}stc_tim3_m23_input_config_t;   

/**
 ******************************************************************************
 ** \brief ETR输入相位滤波配置结构体定义(模式23)
 *****************************************************************************/
typedef struct stc_tim3_m23_etr_input_config
{
    en_tim3_port_polarity_t     enETRPolarity;  ///< ETR输入极性设置
    en_tim3_flt_t               enETRFlt;       ///< ETR滤波设置
}stc_tim3_m23_etr_input_config_t;

/**
 ******************************************************************************
 ** \brief 刹车BK输入相位滤波配置结构体定义(模式23)
 *****************************************************************************/
typedef struct stc_tim3_m23_bk_input_config
{
    boolean_t                   bEnBrake;         ///< 刹车使能
    boolean_t                   bEnVC0Brake;      ///< 使能VC0刹车
    boolean_t                   bEnVC1Brake;      ///< 使能VC1刹车
    boolean_t                   bEnSafetyBk;      ///< 使能safety刹车
    boolean_t                   bEnBKSync;        ///< TIM0/TIM1/TIM2刹车同步使能
    en_tim3_m23_crchx_bks_t     enBkCH0AStat;     ///< 刹车时CHA端口状态设置
    en_tim3_m23_crchx_bks_t     enBkCH0BStat;     ///< 刹车时CHB端口状态设置
    en_tim3_m23_crchx_bks_t     enBkCH1AStat;     ///< 刹车时CHA端口状态设置
    en_tim3_m23_crchx_bks_t     enBkCH1BStat;     ///< 刹车时CHB端口状态设置
    en_tim3_m23_crchx_bks_t     enBkCH2AStat;     ///< 刹车时CHA端口状态设置
    en_tim3_m23_crchx_bks_t     enBkCH2BStat;     ///< 刹车时CHB端口状态设置
    en_tim3_port_polarity_t     enBrakePolarity;  ///< 刹车BK输入极性设置
    en_tim3_flt_t               enBrakeFlt;       ///< 刹车BK滤波设置
}stc_tim3_m23_bk_input_config_t;

/**
 ******************************************************************************
** \brief 死区功能配置结构体定义(模式23)
 *****************************************************************************/
typedef struct stc_tim3_m23_dt_config
{
    boolean_t       bEnDeadTime;      ///< 刹车时CHA端口状态设置
    uint8_t         u8DeadTimeValue;  ///< 刹车时CHA端口状态设置
}stc_tim3_m23_dt_config_t;

/**
 ******************************************************************************
 ** \brief 触发ADC配置结构体定义(模式23)
 *****************************************************************************/
typedef struct stc_tim3_m23_adc_trig_config
{
    boolean_t     bEnTrigADC;          ///< 触发ADC全局控制
    boolean_t     bEnUevTrigADC;       ///< 事件更新触发ADC
    boolean_t     bEnCH0ACmpTrigADC;   ///< CH0A比较匹配触发ADC
    boolean_t     bEnCH0BCmpTrigADC;   ///< CH0B比较匹配触发ADC
    boolean_t     bEnCH1ACmpTrigADC;   ///< CH0A比较匹配触发ADC
    boolean_t     bEnCH1BCmpTrigADC;   ///< CH0B比较匹配触发ADC
    boolean_t     bEnCH2ACmpTrigADC;   ///< CH0A比较匹配触发ADC
    boolean_t     bEnCH2BCmpTrigADC;   ///< CH0B比较匹配触发ADC
}stc_tim3_m23_adc_trig_config_t;

/**
 ******************************************************************************
 ** \brief  DMA触发 配置结构体定义(模式23)
 *****************************************************************************/
typedef struct stc_tim3_m23_trig_dma_config
{
    boolean_t                bUevTrigDMA;      ///< 更新 触发DMA使能
    boolean_t                bTITrigDMA;       ///< Trig 触发DMA功能
    boolean_t                bCmpA0TrigDMA;    ///< CH0A捕获比较触发DMA使能
    boolean_t                bCmpB0TrigDMA;    ///< CH0B捕获比较触发DMA使能
    boolean_t                bCmpA1TrigDMA;    ///< CH1A捕获比较触发DMA使能
    boolean_t                bCmpB1TrigDMA;    ///< CH1B捕获比较触发DMA使能
    boolean_t                bCmpA2TrigDMA;    ///< CH2A捕获比较触发DMA使能
    boolean_t                bCmpB2TrigDMA;    ///< CH2B捕获比较触发DMA使能
    en_tim3_m23_mscr_ccds_t  enCmpUevTrigDMA;  ///< 比较模式下DMA比较触发选择
}stc_tim3_m23_trig_dma_config_t;

/**
 ******************************************************************************
 ** \brief  主从模式 配置结构体定义(模式23)
 *****************************************************************************/
typedef struct stc_tim3_m23_master_slave_config
{
    en_tim3_m23_mscr_msm_t      enMasterSlaveSel;  ///< 主从模式选择
    en_tim3_m23_mscr_mms_t      enMasterSrc;       ///< 主模式触发源选择
    en_tim3_m23_mscr_sms_t      enSlaveModeSel;    ///< 从模式选择
    en_tim3_mscr_ts_t           enTsSel;           ///< 触发输入源选择
}stc_tim3_m23_master_slave_config_t;

/**
 ******************************************************************************
 ** \brief  OCREF清除功能 配置结构体定义(模式23)
 *****************************************************************************/
typedef struct stc_tim3_m23_OCREF_Clr_config
{
    en_tim3_m23ce_occs_t       enOCRefClrSrcSel;  ///< OCREF清除源选择
    boolean_t                  bVCClrEn;          ///< 是否使能来自VC的OCREF_Clr
}stc_tim3_m23_OCREF_Clr_config_t;

/******************************************************************************
 * Global variable declarations ('extern', definition in C source)
 *****************************************************************************/

/******************************************************************************
 * Global function prototypes (definition in C source)
 *****************************************************************************/
//中断相关函数

//中断标志获取
boolean_t Tim3_GetIntFlag(en_tim3_irq_type_t enTim3Irq);
//中断标志清除
en_result_t Tim3_ClearIntFlag(en_tim3_irq_type_t enTim3Irq);
//所有中断标志清除
en_result_t Tim3_ClearAllIntFlag(void);
//模式0中断使能
en_result_t Tim3_Mode0_EnableIrq(void);
//模式1中断使能
en_result_t Tim3_Mode1_EnableIrq (en_tim3_irq_type_t enTim3Irq);
//模式2中断使能
en_result_t Tim3_Mode23_EnableIrq (en_tim3_irq_type_t enTim3Irq);
//模式0中断禁止
en_result_t Tim3_Mode0_DisableIrq(void);
//模式1中断禁止
en_result_t Tim3_Mode1_DisableIrq (en_tim3_irq_type_t enTim3Irq);
//模式2中断禁止
en_result_t Tim3_Mode23_DisableIrq (en_tim3_irq_type_t enTim3Irq);


//模式0初始化及相关功能操作

//timer配置及初始化
en_result_t Tim3_Mode0_Init(stc_tim3_mode0_config_t* pstcConfig);
//timer 启动/停止
en_result_t Tim3_M0_Run(void);
en_result_t Tim3_M0_Stop(void);
//重载值设置
en_result_t Tim3_M0_ARRSet(uint16_t u16Data);
//16位计数值设置/获取
en_result_t Tim3_M0_Cnt16Set(uint16_t u16Data);
uint16_t Tim3_M0_Cnt16Get(void);
//32位计数值设置/获取
en_result_t Tim3_M0_Cnt32Set(uint32_t u32Data);
uint32_t Tim3_M0_Cnt32Get(void);
//翻转输出使能/禁止设定
en_result_t Tim3_M0_EnTOG_Output(boolean_t bEnOutput);


//模式1初始化及相关功能操作

//timer配置及初始化
en_result_t Tim3_Mode1_Init(stc_tim3_mode1_config_t* pstcConfig);
//PWC 输入配置
en_result_t Tim3_M1_Input_Config(stc_tim3_pwc_input_config_t* pstcConfig);
//PWC测量边沿起始结束选择
en_result_t Tim3_M1_PWC_Edge_Sel(en_tim3_m1cr_Edge_t enEdgeSel);
//timer 启动/停止
en_result_t Tim3_M1_Run(void);
en_result_t Tim3_M1_Stop(void);
//16位计数值设置/获取
en_result_t Tim3_M1_Cnt16Set(uint16_t u16Data);
uint16_t Tim3_M1_Cnt16Get(void);
//脉冲宽度测量结果数值获取
uint16_t Tim3_M1_PWC_CapValueGet(void);


//模式1初始化及相关功能操作

//timer配置及初始化
en_result_t Tim3_Mode23_Init(stc_tim3_mode23_config_t* pstcConfig);
//timer 启动/停止
en_result_t Tim3_M23_Run(void);
en_result_t Tim3_M23_Stop(void);
//PWM输出使能
en_result_t Tim3_M23_EnPWM_Output(boolean_t bEnOutput, boolean_t bEnAutoOutput);
//重载值设置
en_result_t Tim3_M23_ARRSet(uint16_t u16Data, boolean_t bArrBufEn);
//16位计数值设置/获取
en_result_t Tim3_M23_Cnt16Set(uint16_t u16Data);
uint16_t Tim3_M23_Cnt16Get(void);
//比较捕获寄存器CCR0A/CCR0B设置/读取
en_result_t Tim3_M23_CCR_Set(en_tim3_m23_ccrx_t enCCRSel, uint16_t u16Data);
uint16_t Tim3_M23_CCR_Get(en_tim3_m23_ccrx_t enCCRSel);
//PWM互补输出模式下，GATE功能选择
en_result_t Tim3_M23_GateFuncSel(stc_tim3_m23_gate_config_t* pstcConfig);
//主从模式配置
en_result_t Tim3_M23_MasterSlave_Set(stc_tim3_m23_master_slave_config_t* pstcConfig);
//CH0A/CH0B比较通道控制
en_result_t Tim3_M23_PortOutput_Config(en_tim3_channel_t enTim3Chx, stc_tim3_m23_compare_config_t* pstcConfig);
//CH0A/CH0B输入控制
en_result_t Tim3_M23_PortInput_Config(en_tim3_channel_t enTim3Chx, stc_tim3_m23_input_config_t* pstcConfig);
//ERT输入控制
en_result_t Tim3_M23_ETRInput_Config(stc_tim3_m23_etr_input_config_t* pstcConfig);
//刹车BK输入控制
en_result_t Tim3_M23_BrakeInput_Config(stc_tim3_m23_bk_input_config_t* pstcConfig);
//触发ADC控制
en_result_t Tim3_M23_TrigADC_Config(stc_tim3_m23_adc_trig_config_t* pstcConfig);
//死区功能
en_result_t Tim3_M23_DT_Config(stc_tim3_m23_dt_config_t* pstcConfig);
//重复周期设置
en_result_t Tim3_M23_SetValidPeriod(uint8_t u8ValidPeriod);
//OCREF清除功能
en_result_t Tim3_M23_OCRefClr(stc_tim3_m23_OCREF_Clr_config_t* pstcConfig);
//使能DMA传输
en_result_t Tim3_M23_EnDMA(stc_tim3_m23_trig_dma_config_t* pstcConfig);
//捕获比较A软件触发
en_result_t Tim3_M23_EnSwTrigCapCmpA(en_tim3_channel_t enTim3Chx);
//捕获比较B软件触发
en_result_t Tim3_M23_EnSwTrigCapCmpB(en_tim3_channel_t enTim3Chx);
//软件更新使能
en_result_t Tim3_M23_EnSwUev(void);
//软件触发使能
en_result_t Tim3_M23_EnSwTrig(void);
//软件刹车使能
en_result_t Tim3_M23_EnSwBk(void);


//@} // Tim3Group

#ifdef __cplusplus
#endif


#endif /* __BT_H__ */
/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/


